// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'

// const a = 5;

// if (a === 10) {
//   console.log(true);
// } else {
//   console.log(false);
// }

// Використовуючи функцію if...else,
// напишіть код, який запитуватиме:
// "Яка офіційна назва JavaScript?"
// Якщо користувач вводить "ECMAScript",
// то показати через alert: "Вірно!"
// інакше відобразити:"Не знаєте? ECMAScript!"

// const nameJs = prompt("Яка офіційна назва JavaScript?");

// if (nameJs === "ECMAScript") {
//   alert("Вірно!");
// } else {
//   alert("Не знаєте? ECMAScript!");
// }

//  Напишіть цикл, який виводить у консоль числа від max до min за спаданням
//  Виведіть у консоль суму усіх парних чисел від min до max
// const max = 50;
// const min = 23;
// let total = 0;
// for (let i = max; i >= min; i--) {
// 	// console.log(i);
// 	if (i % 2 === 0) {
// 		total += i;
// 	}
// }
// console.log(total);

// Напишіть код, який запитуватиме
// Логін за допомогою prompt і логувати результат
// В консоль браузера

// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль.
// Якщо нічого не ввели або натиснута клавіша Esc
// Вивести рядок "Скасовано"
//  Інакше вивести рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний", то вивести рядок "Здрастуйте!"
// інакше виводити рядок "Невірний пароль!"

const loginInput = prompt("Введіть логін");

if (loginInput === "Адмін") {
	const passwordInput = prompt("Введіть пароль");
	if (passwordInput) {
		if (passwordInput === "Я головний") {
			console.log("Здрастуйте!");
		} else {
			console.log("Невірний пароль!");
		}
	} else {
		console.log("Скасовано");
	}
} else {
	console.log("Я вас не знаю");
}
