// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'

// const a = 5;

// if (a === 10) {
//   console.log(true);
// } else {
//   console.log(false);
// }

// Використовуючи функцію if...else,
// напишіть код, який запитуватиме:
// "Яка офіційна назва JavaScript?"
// Якщо користувач вводить "ECMAScript",
// то показати через alert: "Вірно!"
// інакше відобразити:"Не знаєте? ECMAScript!"

// const nameJs = prompt("Яка офіційна назва JavaScript?");

// if (nameJs === "ECMAScript") {
//   alert("Вірно!");
// } else {
//   alert("Не знаєте? ECMAScript!");
// }

//  Напишіть цикл, який виводить у консоль числа від max до min за спаданням
//  Виведіть у консоль суму усіх парних чисел від min до max
// const max = 50;
// const min = 23;
// let total = 0;
// for (let i = max; i >= min; i--) {
// 	// console.log(i);
// 	if (i % 2 === 0) {
// 		total += i;
// 	}
// }
// console.log(total);

// Напишіть код, який запитуватиме
// Логін за допомогою prompt і логувати результат
// В консоль браузера

// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль.
// Якщо нічого не ввели або натиснута клавіша Esc
// Вивести рядок "Скасовано"
//  Інакше вивести рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний", то вивести рядок "Здрастуйте!"
// інакше виводити рядок "Невірний пароль!"

// const loginInput = prompt("Введіть логін");

// if (loginInput === "Адмін") {
// 	const passwordInput = prompt("Введіть пароль");
// 	if (passwordInput) {
// 		if (passwordInput === "Я головний") {
// 			console.log("Здрастуйте!");
// 		} else {
// 			console.log("Невірний пароль!");
// 		}
// 	} else {
// 		console.log("Скасовано");
// 	}
// } else {
// 	console.log("Я вас не знаю");
// }

// При завантаженні сторінки користувачеві пропонується
// В prompt ввести число. Введення додається до значення
// Змінної total.
// Операція введення числа триває до того часу,
// Поки користувач не натисне кнопку Cancel в prompt.
// Після того, як користувач припинив введення натиснувши накнопку Cancel, показати alert з рядком "Загальна сума введених чисел дорівнює [число]."
// Робити перевірку,що користувач ввів саме число, а не довільний набір символів не потрібно.

// let numberInput = prompt('Введите число');
// let total = 0;
// let check = false;

// do {
//   if (numberInput) {
//     total += Number(numberInput);
//     check = true;
//     numberInput = prompt('Введите число');
//   } else {
//     check = false;
//     alert(`Загальна сума введених чисел дорівнює число ${total}.`);
//   }
// } while (check);

//  Напишіть цикл, який пропонує ввести число більше 100 через prompt.
// Якщо якщо відвідувач ввів інше число - попросити
// Ввести ще раз і так далі.
// Цикл повинен запитувати число, поки відвідувач не введе число більше 100, або натисне кнопку
// Скасування в prompt

// let numberInput = prompt('Введите число больше 100');
// let check = false;

// do {
//   if (Number(numberInput) < 100) {
//     check = true;
//     numberInput = prompt('Введите число больше 100');
//   } else {
//     check = false;
//   }
// } while (check);

// alert(numberInput);
