// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'

// const a = 5;

// if (a === 10) {
//   console.log(true);
// } else {
//   console.log(false);
// }

// Використовуючи функцію if...else,
// напишіть код, який запитуватиме:
// "Яка офіційна назва JavaScript?"
// Якщо користувач вводить "ECMAScript",
// то показати через alert: "Вірно!"
// інакше відобразити:"Не знаєте? ECMAScript!"

// const nameJs = prompt("Яка офіційна назва JavaScript?");

// if (nameJs === "ECMAScript") {
//   alert("Вірно!");
// } else {
//   alert("Не знаєте? ECMAScript!");
// }

//  Напишіть цикл, який виводить у консоль числа від max до min за спаданням
//  Виведіть у консоль суму усіх парних чисел від min до max
// const max = 50;
// const min = 23;
// let total = 0;
// for (let i = max; i >= min; i--) {
// 	// console.log(i);
// 	if (i % 2 === 0) {
// 		total += i;
// 	}
// }
// console.log(total);

// Напишіть код, який запитуватиме
// Логін за допомогою prompt і логувати результат
// В консоль браузера

// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль.
// Якщо нічого не ввели або натиснута клавіша Esc
// Вивести рядок "Скасовано"
//  Інакше вивести рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний", то вивести рядок "Здрастуйте!"
// інакше виводити рядок "Невірний пароль!"

// const loginInput = prompt("Введіть логін");

// if (loginInput === "Адмін") {
// 	const passwordInput = prompt("Введіть пароль");
// 	if (passwordInput) {
// 		if (passwordInput === "Я головний") {
// 			console.log("Здрастуйте!");
// 		} else {
// 			console.log("Невірний пароль!");
// 		}
// 	} else {
// 		console.log("Скасовано");
// 	}
// } else {
// 	console.log("Я вас не знаю");
// }

// При завантаженні сторінки користувачеві пропонується
// В prompt ввести число. Введення додається до значення
// Змінної total.
// Операція введення числа триває до того часу,
// Поки користувач не натисне кнопку Cancel в prompt.
// Після того, як користувач припинив введення натиснувши накнопку Cancel, показати alert з рядком "Загальна сума введених чисел дорівнює [число]."
// Робити перевірку,що користувач ввів саме число, а не довільний набір символів не потрібно.

// let numberInput = prompt('Введите число');
// let total = 0;
// let check = false;

// do {
//   if (numberInput) {
//     total += Number(numberInput);
//     check = true;
//     numberInput = prompt('Введите число');
//   } else {
//     check = false;
//     alert(`Загальна сума введених чисел дорівнює число ${total}.`);
//   }
// } while (check);

//  Напишіть цикл, який пропонує ввести число більше 100 через prompt.
// Якщо якщо відвідувач ввів інше число - попросити
// Ввести ще раз і так далі.
// Цикл повинен запитувати число, поки відвідувач не введе число більше 100, або натисне кнопку
// Скасування в prompt

// let numberInput = prompt('Введите число больше 100');
// let check = false;

// do {
//   if (Number(numberInput) < 100) {
//     check = true;
//     numberInput = prompt('Введите число больше 100');
//   } else {
//     check = false;
//   }
// } while (check);

// alert(numberInput);

// У змінній min лежить число від 0 до 59.
//  Визначте, в яку чверть години потрапляє це число(у першу, другу, третю чи четверту).

// let min = 40;
// if (min >= 0 && min < 15) {
//   alert("перша четверть");
// }
// if (min >= 15 && min < 30) {
//   alert("друга четверть");
// }
// if (min >= 30 && min < 45) {
//   alert("третя четверть");
// }
// if (min >= 45 && min < 60) {
//   alert("четверта четверть");
// }

// .Дано рядок, що складається із символів, наприклад, 'abcde'.
//  Перевірте, що першим символом цього рядка є буква 'a'.
//  Якщо це так - виведіть 'так', інакше виведіть 'ні'.

// const string = "abcde";
// if (string[0] === "a") {
//   console.log(true);
// } else {
//   console.log(false);
// }

// const string = "abcde";
// string[0] === "a" ? console.log(true) : console.log(false);

// Напишіть через свіч пошуку автора мови програмування
//  пишемо назву мови у шаблонному рядку отримує відповідь мова та автор
//  PHP Расмус Лердорф
//  C# група інженерів компанії Microsoft під керівництвом Андерса Хейлсберга та Скотта Вільтаумота
//  Swift Кріс Латтнер
//  JS Брендан Ейх
//  Java Джеймс Гослінг
//  Python Гвідо ван Россум

// const language = prompt("Введіть мову програмування");
// switch(language) {
//     case "PHP":
//         console.log(`${language} - Расмус Лердорф`);
//         break;
//     case "C#":
//         console.log(`${language} - група інженерів компанії Microsoft під керівництвом Андерса Хейлсберга та Скотта Вільтаумота`);
//         break;
//     case "Swift":
//         console.log(`${language} - Кріс Латтнер`);
//         break;
//     case "JS":
//         console.log(`${language} - Брендан Ейх`);
//         break;
//     case "Java":
//         console.log(`${language} - Джеймс Гослінг`);
//         break;
//     case "Python":
//         console.log(`${language} - Гвідо ван Россум`);
//         break;
//     default: console.log(`Автора не знайдено`);
// }

// ЗАПИТАТИ У КОРИСТУВАЧА ІМЯ, ПОЧТУ , ТЕЛЕФОН, І ПОКАЗАТИ У КОНСОЛІ "КОРИСТУВАЧ __ ВИКОРИСТОВУЄ  __ ПОЧТУ І __ ТЕЛЕФОН"

// const userName = prompt("Введіть ім'я");
// const userMail = prompt("Введіть пошту");
// const userPhone = prompt("Введіть телефон");

// // console.log(`КОРИСТУВАЧ ${userName} ВИКОРИСТОВУЄ ${userMail} ПОЧТУ І ${userPhone}`);
// НАПИШІТЬ ПРОГРАМУ, ЯКА БУДЕ ВИЗНАЧАТИ ДОВЖИНУ ІМЕНІ , ЯКЩО ІМЯ БІЛЬШЕ 7 СИМВОЛІВ, КОНСОЛЬ ВИВОДИТЬ "Wow, you  have a REALLY long name!" , ЯКЩО МЕНШЕ 7
// "Your name isn't very long"
// const userName = prompt("Введите имя");
// userName.length >= 7
//   ? console.log('Wow, you  have a REALLY long name!')
//   : console.log("Your name isn't very long");
// НАПИШІТЬ ПРОГРАМУ , ЯКА БУДЕ ЗАПИТУВАТИ У КОРИСТУВАЧА ПЕРІОД ПІДПИСКИ НА СЕРВІС ТА ПОКАЗУВАТИМЕ ЦІНУ ПІДПИСКИ(ВИКОРИСТАЙ IF..ELSE, ТА ПЕРЕПИШИ НА SWITCH)
// ЯКЩО ДЕНЬ - ціна 1.99
// ЯУЩО НЕДІЛЯ - ціна 5.99
// ЯКЩО МІСЯЦЬ - ціна 10.99
// ЯКЩО РІК - ціна 100.99
const period = prompt("Введите термин подписки")
switch (period) {
    case 'день':
        console.log('ціна 1.99');
        break;
    case 'неделя':
        console.log('ціна 5.99');
        break;
    case 'месяць':
        console.log('ціна 10.99');
        break;
    case 'год':
        console.log('ціна 100.99');
        break;
    default: console.log("Нет подписки")
}